Repository: 84000/data-translation-memory
Catalog: toh56-v4.tmx
Source language: bo
Languages: en

source: གཞན་ཡང་ཤ་རིའི་བུ་བྱང་ཆུབ་སེམས་དཔའི་འདི་ལྟར་སེམས་བསྐྱེད་དེ། ཀྱེ་མའོ་སེམས་ཅན་འདི་དག་ནི་བཀའ་བློ་མི་བདེ་བ་སྟེ། སློབ་དཔོན་གྱི་རྗེས་སུ་བསྟན་པ་དང་མི་འཐུན་པར་འཛིན་པས་དེ་དག་ཁོང་དུ་མི་ཆུད་དོ། ། ཅི་ཁོང་དུ་མི་ཆུད་ཅེ་ན་འདི་ལྟ་སྟེ། སློབ་དཔོན་གྱི་ནོར་ཁོང་དུ་མི་ཆུད་དོ། ། སློབ་དཔོན་གྱི་ནོར་གང་ཞེ་ན། འདི་ལྟ་སྟེ། དད་པའི་ནོར་དང་། ཚུལ་ཁྲིམས་ཀྱི་ནོར་དང་། ཐོས་པའི་ནོར་དང་། ཁྲེལ་ཡོད་པའི་ནོར་དང་། ངོ་ཚ་ཤེས་པའི་ནོར་དང་། གཏོང་བའི་ནོར་དང་། ཤེས་རབ་ཀྱི་ནོར་ཏེ། དེ་དག་ནི་སློབ་དཔོན་གྱི་ནོར་ཞེས་བྱ་སྟེ། དེ་དག་ཁོང་དུ་མ་ཆུད་པས་ན་རབ་ཏུ་དབུལ་བ་ཞེས་བྱའོ། ། བདག་ནི་བཀའ་བློ་བདེ་ཞིང་སློབ་དཔོན་གྱི་རྗེས་སུ་བསྟན་པ་དང་འཐུན་པར་བྱའོ། ། དེ་ཅིའི་ཕྱིར་ཞེ་ན། བྱང་ཆུབ་སེམས་དཔའ་ནི་ཤིན་ཏུ་བཀའ་བློ་བདེ་བ་སྟེ། སློབ་དཔོན་གྱི་རྗེས་སུ་བསྟན་པ་དང་འཐུན་པར་འཛིན་ཅིང་ཁོང་དུ་ཆུད་པར་བྱེད་དོ། ། ཅི་ཁོང་དུ་ཆུད་ཅེ་ན། འདི་ལྟ་སྟེ། སློབ་དཔོན་གྱི་ནོར་རོ། ། བྱང་ཆུབ་སེམས་དཔའི་སློབ་དཔོན་གྱི་ནོར་གང་ཞེ་ན། འདི་ལྟ་སྟེ། བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཀྱི་ཆོས་ཀྱི་རྣམ་གྲངས་སོ། ། སློབ་དཔོན་གྱིས་བྱང་ཆུབ་སེམས་དཔའ་རྣམ་པ་ཐམས་ཅད་དུ་བཀའ་བློ་བདེ་བར་རིག་ནས་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཀྱི་ཆོས་ཀྱི་རྣམ་གྲངས་རྒྱ་ཆེར་སྟོན་ཏོ། ། རབ་ཏུ་སྟོན་ཏོ། ། རབ་ཏུ་འཆད་དོ། ། རབ་ཏུ་གཞོག་གོ ། རྣམ་པར་འགྲེལ་ཏོ། ། རྣམ་པར་འབྱེད་དོ། ། གསལ་པོར་གོ་བར་བྱེད་དོ། ། ཡང་དག་པར་རབ་ཏུ་སྟོན་ཏོ། ། བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ལ་རབ་ཏུ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་དབུལ་བ་ཡོངས་སུ་ཆད་པ་ཁོང་དུ་ཆུད་པར་འགྱུར་ཏེ། འདི་ལྟ་སྟེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་བོ། །དེ་དེ་ལྟར་སེམས་བསྐྱེད་དེ་བཀའ་བློ་བདེ་ཞིང་སློབ་དཔོན་གྱི་བསྟན་པ་དང་འཐུན་པར་འཛིན་པ་ནི་སྙིང་པོ་མེད་པའི་ལུས་ལས་སྙིང་པོ་བླངས་པར་འགྱུར་རོ་སྙམ་ནས་སློབ་དཔོན་ལ་རིམ་གྲོ་དང་། བསྙེན་བཀུར་བྱེད་དེ་ཐ་ན་ཆུ་རྫ་གང་ཙམ་ཡང་འབུལ་ལོ། །
en: “Furthermore, Śāriputra, the bodhisatva cultivates the following thought: ‘Alas! Sentient beings do not value advice. They dislike their teacher’s instructions and are not able to understand them. What is it they do not understand? They do not understand the riches of the teacher. What are the riches of the teacher? The riches of faith, the riches of morality, the riches of learning, the riches of conscience and moral sensitivity, the riches of renunciation, and the riches of wisdom—these are considered to be the riches of the teacher. Those who do not understand this can be said to be utterly impoverished. I will value the advice I receive and keep an open attitude toward the instructions of the teacher. How is this to be done? The bodhisatva who values advice keeps an open attitude toward the instructions of the teacher and attains understanding. What is it that he understands? He understands the riches of the teacher. What are the riches of the bodhisatva’s teacher? These riches comprise the cycle of teachings contained in The Collected Teachings on the Bodhisatva. When the teacher sees that the receptive bodhisatva is able to value his advice, he will give him a detailed explanation of the cycle of teachings contained in The Collected Teachings on the Bodhisatva. He will teach it to him, guide him in it, expound it for him, illuminate it for him, instruct him in it, open it up for him, and make it manifest to him. The bodhisatva who gains a firm mastery of The Collected Teachings on the Bodhisatva completely eliminates poverty and gains understanding—the state of a fully accomplished buddha. Having cultivated this thought, I will give meaning to this insubstantial body by valuing the advice I receive and maintaining an open attitude toward the instructions of the teacher. In this way, one honors and serves one’s teacher to the extent that one will even be willing to give up one’s water flask.’

source: ཤཱ་རིའི་བུ་སེམས་བསྐྱེད་པ་བཅུ་པ་འདི་བསྐྱེད་ནས་བྱང་ཆུབ་སེམས་དཔའ་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཡོངས་སུ་ཚོལ་བས་སློབ་དཔོན་ལ་བསྙེན་བཀུར་དང་། རིམ་གྲོ་བྱེད་དེ།་ཐ་ན་ཆུ་རྫ་གང་ཙམ་ཡང་འབུལ་ལོ། །
en: “This, Śāriputra, is the tenth thought the bodhisatva cultivates, and so he applies himself to The Collected Teachings on the Bodhisatva, honoring and serving his teacher to the extent that he will even be willing to give up his water flask.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་གསུངས་ཏེ།་བདེ་བར་གཤེགས་པས་དེ་སྐད་བཀའ་སྩལ་ནས་སྟོན་པ་ཡང་འདི་སྐད་གསུང་ངོ་། །
en: This is what the Lord said. After the Sugata had said this, he, the teacher, continued as follows:

source: བཀའ་བློ་མི་བདེ་སེམས་ཅན་གང་། །མི་དྲང་སྒྱུ་དང་གཡོ་ངན་ཅིང་། །བླ་མ་རྣམས་དང་མི་འཐུན་པ། །ཚིག་བཞིན་དུ་ནི་བྱེད་མི་འགྱུར། །
en: “Sentient beings do not value advice. They are deceitful, cunning, and dishonest. They dislike their gurus And do not follow their teaching.

source: བསྟན་པ་དང་ནི་མི་འཐུན་ཞིང་། །བཀའ་བློ་མི་བདེ་ཤེས་གྱུར་ནས། ། དྲང་སྲོང་ནོར་ནི་གང་ཡིན་པ། །དེ་ནི་དེ་ལ་མི་སྟོན་ཏོ། །
en: “As they do not value advice And dislike the teachings, The riches of the sage Are not revealed to them.

source: དད་པའི་ནོར་དང་ཚུལ་ཁྲིམས་ནོར། །ཁྲེལ་ཡོད་ངོ་ཚ་ཤེས་པའི་ནོར། །ཐོས་པའི་ནོར་དང་གཏོང་ནོར་དང་། །ཤེས་རབ་ཉིད་ནི་ནོར་བདུན་པ། །
en: “The riches of faith, the riches of morality, The riches of conscience and moral sensitivity, The riches of learning, the riches of renunciation, And wisdom—these are the seven kinds of riches.

source: ནོར་གྱི་རྣམ་པ་འདི་དག་ནི། །མི་ཟད་པ་ཡི་གཏེར་བདུན་ཏེ། །
en: “These seven kinds of riches Are inexhaustible treasures,

source: སྣོད་མ་ཡིན་པར་རིག་ནས་ནི། །དེ་ནི་དེ་ལ་མི་སྟོན་ཏོ། །
en: But they are not revealed To those who are not worthy recipients.

source: སེམས་ཅན་གང་དག་རྣམ་པ་ཀུན། །སངས་རྒྱས་ཆོས་ཀྱི་སྣོད་གྱུར་ཅིང་། །གཡོ་མེད་ཚིག་འཇམ་སྒྱུ་མེད་ལ། །བཀའ་བློ་བདེ་ཞིང་རབ་འཐུན་པ། །
en: “All those sentient beings Who are not dishonest, corrupt, or deceitful But value the teachings and are grateful for them Are fit to receive the Dharma of the Buddha.

source: སངས་རྒྱས་ཀྱི་ནི་བྱང་ཆུབ་ཕྱིར། །ལུས་དང་སྲོག་ལ་མི་ལྟ་བར། །གུས་དང་བཅས་པའི་ཆོས་འདོད་ཅིང་། །བརྩོན་འགྲུས་རྩོམ་པ་བར་ཏུ་སེམས། །
en: “Filled with vigor and enthusiasm To attain the awakening of a buddha, They long for the Dharma and devote themselves to it With no concern for their bodies or their lives.

source: ཚུལ་འདི་འཛིན་པར་འགྱུར་བ་ཡི། །སྣོད་དུ་རུང་བར་རིག་གྱུར་ནས ཆོས་ཀྱི་དབྱིངས་ནི་དབྱེར་མེད་པ། །འདྲེན་པས་ཡང་དག་རབ་ཏུ་སྟོན། །
en: “Seeing that he is fit to receive the teachings And is able to follow the way, The guides will reveal to him The indivisibility of the totality of phenomena.

source: གང་ལ་བྱང་ཆུབ་གནས་པ་ཡི། །སངས་རྒྱས་རྣམས་ཀྱི་སྙིང་པོའི་ནོར། །བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ནི། །རྒྱས་པར་རབ་ཏུ་སྟོན་པར་བྱེད། །
en: “The Collected Teachings on the Bodhisatva Is where awakening resides, And they reveal this treasure, The essence of the buddhas, in detail.

source: ཆོས་རྣམས་ཐམས་ཅད་བདག་མེད་དེ། ། མཚན་མེད་སྟོང་པའི་མཚན་ཉིད་ཅན། །སྲོག་ཀྱང་མེད་ཅིང་འགྱུར་བ་མེད། ། སྤྲོས་པ་མེད་དེ་ཀུན་གཞི་མེད། །
en: “All phenomena lack self; They have no attributes and are characterized by emptiness. They have no life force, they do not change, They do not proliferate, and they rest nowhere.

source: ཆོས་རྣམས་ཐམས་ཅད་རང་བཞིན་གྱིས། །མ་སྐྱེས་ཤིང་ནི་མཚན་ཉིད་མེད། །
en: “All phenomena are by nature Unborn and without essential characteristics.

source: བྱུང་བ་མེད་ཅིང་གྲུབ་པ་མེད། ། མཚན་མ་མེད་པས་ཕྱེ་བ་སྟེ།
en: They do not arise, they do not develop, And they are characterized by the fact that they lack attributes.

source: མི་གང་བཀའ་བློ་བདེ་ཞིང་མི་འགལ་བ། །བསྟན་པ་ལ་ནི་རྗེས་སུ་འཐུན་འཛིན་པ། །དེ་དག་ལ་ཡང་རྒྱལ་བ་རང་བྱུང་རྣམས། །ཐར་སྒོ་སློབས་ཞེས་རང་གི་སྤྱོད་ཡུལ་སྟོན། །
en: “The self-arisen Victorious One will teach Those men who are reverent and who value advice, Who are favorably disposed toward instruction.

source: དད་ནོར་ཚུལ་ཁྲིམས་ནོར་དང་བྲལ་ཡོད་དང་། །ངོ་ཚ་ཤེས་དང་ཐོས་གཏོང་ཤེས་རབ་དང་། །དེ་ལ་ནོར་འདི་རྣམས་ནི་ཀུན་འགེད་ཅིང་། །བདུན་པོ་མི་ཟད་ཆོས་ཀྱི་མཛོད་ཀྱང་འབྱེད། །
en: He will teach them, through his own experience, the training that is the door to liberation. “They fully embody the riches of faith and the riches of morality, Of conscience and moral sensitivity, of learning, of renunciation, and of wisdom. They embody these riches And reveal to him the treasury of Dharma, these inexhaustible seven.

source: མི་འགའ་བཀའ་བློ་བདེ་ཞིང་རྗེས་སུ་འཐུན། །དགེ་བའི་བཤེས་གཉེན་སྙམ་དུ་རྟག་བསམས་ནས། །
en: “I will always be reverent, value advice, and be open. I will always think of my benevolent spiritual friend.

source: བླ་ན་མེད་པའི་བྱང་ཆུབ་ཚོལ་བའི་ཕྱིར། །བླ་མ་དག་ལ་བདག་གིས་རིམ་གྲོ་བྱ། །
en: In these ways, I will serve the gurus In my pursuit of unsurpassed awakening.

source: དེ་ལྟ་བུ་ཡི་སེམས་ནི་བསྐྱེད་བྱས་ལ། །སྙིང་རྗེ་དགའ་བརྒྱ་ཆེར་རབ་བསྐྱེད་དེ། །
en: “Having cultivated these kinds of thoughts, With the greatest love and compassion,

source: ཁམ་སྣོད་དང་བའི་ཆུ་ཡིས་བཀང་བ་ཡང་། །སྐོམ་པ་དག་ལ་ཉེ་བར་སྦྱིན་པར་བྱ། །
en: I will offer an earthenware container Filled with crystal-clear water to those who are thirsty.

source: ཤཱ་རིའི་བུ་སེམས་བསྐྱེད་པ་བཅུ་པ་འདི་བསྐྱེད་ནས་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཡོངས་སུ་ཚོལ་བས་སློབ་དཔོན་ལ་ལུས་ཀྱིས་བསྙེན་བཀུར་དང་རིམ་གྲོ་བྱེད་དེ། ཐ་ན་ཆུ་རྫ་གང་ཙམ་ཡང་འབུལ་ལོ། །
en: “These then, Śāriputra, are the ten thoughts the bodhisatva cultivates, and so he applies himself to The Collected Teachings on the Bodhisatva, honoring and serving his teacher to the extent that he would even be willing to give up his water flask.

source: དེ་དགེ་བའི་རྩ་བ་དེས་ཆོས་བཞི་ཐོབ་པར་འགྱུར་ཏེ། བཞི་གང་ཞེ་ན། མྱུར་དུ་དགེ་བའི་ཆོས་ལ་འཇུག་པ་དང་། སློབ་དཔོན་གྱི་བསྔགས་པ་བརྗོད་པར་འགྱུར་བ་དང་། ནན་ཏན་གྱིས་སྒྲུབ་ཀྱི་ལོག་པའི་ནན་ཏན་གྱིས་མ་ཡིན་པ་དང་། ཆོས་ཀྱི་ཕྱིར་སྡུག་བསྔལ་གྱི་གཞན་དུ་ཕྱོགས་པར་མི་འགྱུར་བ་སྟེ། ཤཱ་རིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་མིར་གྱུར་པ་ན་ཆོས་བཞི་པོ་དེ་དག་ཐོབ་པར་འགྱུར་རོ། །
en: “By means of these roots of virtue, such a bodhisatva obtains four things. What are these four things? He is able to quickly understand the teachings on what is wholesome. He praises his teacher. His efforts bear fruit, and he does not regress. Because of the Dharma, he does not allow himself to become disheartened by suffering. These, Śāriputra, are the four things such a bodhisatva obtains in a human existence.

source: གཞན་ཡང་ཆོས་བཞི་ཐོབ་པར་འགྱུར་ཏེ། བཞི་གང་ཞེ་ན། སྐྱེ་བོ་མང་པོའི་རྗེས་སུ་བསླབས་ནས་དཀར་པོའི་ཆོས་ལ་གནས་པ་དང་། སྦས་ཤིང་བཞག་པའི་གནས་སྐྱེ་བོ་མང་པོ་མགུ་བ་དང་། རབ་ཏུ་དགའ་བར་བྱེད་པ་མྱུར་དུ་འཐོབ་པ་དང་། སེམས་དགའ་བཞིན་དུ་ཉིན་མཚན་ཟད་པར་འགྱུར་བ་དང་། ཀུན་ནས་ལྡང་བ་མེད་པར་འཆི་བའི་དུས་བྱས་ནས་བདེ་འགྲོ་མཐོ་རིས་སུ་སྐྱེ་བར་འགྱུར་བ་སྟེ། ཤཱ་རིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཞི་པོ་དེ་དག་ཐོབ་པར་འགྱུར་རོ། །
en: “There is a further set of four things he obtains. What are these four things? Having trained a great many beings, he has a firm foundation in the pure Dharma. He establishes hermitages where one can dwell in seclusion and that effectively bring pleasure and joy to a great many beings. He remains joyful day and night. He does not become overwhelmed, and at death he is reborn in a joyful heavenly existence. These, Śāriputra, are the four further things the bodhisatva obtains.

source: དེ་ལྟར་གྱུར་པ་ན་ཆོས་བཞི་པོ་ཐོབ་པར་འགྱུར་ཏེ། བཞི་གང་ཞེ་ན། ལྷའི་འཁོར་གྱི་སྟན་མཆོག་རྙེད་པར་འགྱུར་བ་དང་། ལྷའི་འཁོར་ཐམས་ཅད་དེའི་གདོང་དུ་ལྟ་ཞིང་ཅི་བཤད་པ་དེ་དག་ཐོས་ནས་ ཤེས་པར་བྱའོ་སྙམ་དུ་སེམས་པར་འགྱུར་བ་དང་། ལྷའི་དབང་པོ་བརྒྱ་བྱིན་དང་། དེ་བཞིན་དུ་ལྷའི་བུ་གཞན་ཡང་དེའི་དྲུང་དུ་འོང་གིས། དེ་ལྷའི་བུ་གཞན་གྱི་དྲུང་དུ་ཐེ་ཚོམ་ཡོངས་སུ་འདྲི་ཞིང་གཅད་པའི་ཕྱིར་འགྲོ་བ་མ་ཡིན་པ་དང་། དེའི་ལོངས་སྤྱོད་ཀྱི་ཕྱིར་གཞལ་མེད་ཁང་ཆེན་པོར་འབྱུང་བ་སྟེ། ཤཱ་རིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཞི་པོ་དེ་དག་ཐོབ་པར་འགྱུར་ཏེ།
en: “When he is born among the gods he obtains four things. What are these four things? He obtains an elevated seat in the assembly of the gods. His fame in all divine assemblies is such that they think, ‘Whatever he says, we will listen to it and take it to heart.’ He is sought out by Śakra, the lord of the gods, as well as by other divine sons, and he does not need to search for other divine sons whom he can address and whose doubts he can eliminate. He manifests great palaces for their enjoyment. These Śāriputra, are the four things the bodhisatva obtains.

source: ལྷར་གྱུར་པ་དང་། མིར་གྱུར་པ་ན་ཆོས་ཀྱི་སྒོ་བརྒྱ་སྟོང་ཕྲག་དཔག་ཏུ་མེད་པ་འཐོབ་པར་འགྱུར་རོ། །
en: “In divine and human existences, he finds hundreds of thousands of immeasurable ways to enter into the Dharma.”

source: དེ་ཡི་སྟན་ནི་མཐོན་པོར་འགྱུར། །
en: “He occupies an elevated seat

source: ལྷ་ཡིས་མངོན་པར་ཕྱག་བྱས་ནས། །
en: And is honored by the gods.

source: གང་དག་ཆོས་འདི་འཆད་པ་ལ། །ལྷ་རྣམས་དེ་ལ་ལྟ་བར་འགྱུར། །
en: Wherever he expounds the Dharma, The gods give him their attention.

source: མཁས་པ་སེར་སྣ་བྲལ་བ་ལ། །ཀུན་གྱི་བསྟི་སྟང་བྱས་པར་འགྱུར། །
en: “All give him their praise As a learned one without selfishness.

source: བརྒྱ་བྱིན་དེ་གན་འདྲིར་འོང་ཞིང་། །གཞལ་མེད་ཁང་ཡང་ཡིད་འོང་བཟང་། །
en: Śakra seeks his advice. His palace is of breathtaking beauty.

source: ལྷ་ཡི་འཇིག་རྟེན་གནས་འཕོས་ཏེ། །
en: “When he leaves the divine realm,

source: མི་ཡི་སྲིད་པར་འོངས་གྱུར་ནས། །
en: He takes on a human existence

source: འཁོར་ལོས་སྒྱུར་བ་སེར་སྣ་མེད། །
en: And becomes a king with great magical powers,

source: རྒྱལ་པོ་རྫུ་འཕྲུལ་ཆེན་པོར་འགྱུར། །
en: An unselfish king of the entire world.

source: མི་ཡི་འཇིག་རྟེན་འཕོས་ནས་ཀྱང་། །ལྷ་ཡི་ནང་དུ་ཡང་འགྲོ་སྟེ། །
en: “Leaving the human realm behind, He returns to the heavens.

source: བླ་མ་དག་ལ་གུས་བྱས་པས། །ནམ་ཡང་སྡུག་བསྔལ་མི་འགྱུར་རོ། །
en: Having shown reverence to the gurus, He does not experience any suffering at all.

source: ཞུམ་པ་མེད་པའི་སེམས་ཀྱིས་སུ། །བླ་མ་དག་ལ་གུས་བྱས་པས། །གནས་བཞི་པོ་ནི་དེ་དག་རྣམས། །རྒྱ་ཆེར་རྟག་ཏུ་རྙེད་པར་འགྱུར། །
en: “These are the four illustrious states That are always obtained By one who is undeterred In his reverence for the gurus.

source: དགའ་བ་དང་ནི་གུས་པ་ཡིས། །སྣོད་གང་ཙམ་གྱི་ཆུ་བྱིན་ན། །
en: “Giving away his water flask Out of affection and veneration,

source: ལྷ་དང་མི་དང་ཀླུ་རྣམས་ཀྱིས། །མཆོད་པ་དག་ཏུ་འོས་པ་ཡིན།། །།
en: He is worthy of being venerated By gods, nāgas, and men.

source: དེ་ལྟར་གྱུར་ན་གཞན་ཡང་ཆོས་བཞི་འཐོབ་པར་འགྱུར་ཏེ། ཆོས་བཞི་གང་ཞེ་ན། སྔོན་གྱི་ལས་མངོན་པར་འདུས་བྱས་པའི་དགེ་བའི་རྩ་བ་གང་གིས་སྐྱེས་པ་རབ་ཏུ་ཤེས་པ་དང་། དེ་ན་དགེ་བའི་ཆོས་རྣམས་ཡོངས་སུ་འདྲི་བ་ཡང་རབ་ཏུ་ཤེས་པ་དང་། དེ་ནས་ཤི་འཕོས་ནས་གང་དུ་སྐྱེ་བར་འགྱུར་བ་དེ་ཡང་རབ་ཏུ་ཤེས་པ་དང་། ལྷའི་འཁོར་ལ་ཆོས་ཀྱི་གཏམ་ཡང་དག་པར་བསྟན། ཡང་དག་པར་འཛིན་དུ་བཅུག ། ཡང་དག་པར་གཟེངས་བསྟོད། ཡང་དག་པར་རབ་ཏུ་དགའ་བར་བྱས་ནས་ལྷའི་འཇིག་རྟེན་ནས་འཆི་འཕོ་བར་འགྱུར་བ་སྟེ། ཤཱ་རིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཞི་པོ་དེ་དག་འཐོབ་པར་འགྱུར་རོ། །
en: “When he dwells among the gods, there is a further set of four things he obtains. What are these four things? He has knowledge of his accumulation of previously performed actions and of the roots of virtue by means of which he has now attained this rebirth. He knows that wholesome things deteriorate. He knows, too, the rebirth he will take when he passes on from this state of existence. After he has instructed the assembly of the gods in the Dharma, encouraged them in their understanding, engaged them, and delighted them, he passes on from the heavenly realms. These, Śāriputra, are the four further things the bodhisatva obtains.

source: གཞན་ཡང་ཤཱ་རིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཞི་འཐོབ་པར་འགྱུར་ཏེ། བཞི་གང་ཞེ་ན། དེ་ལྷའི་གནས་ནས། ཤི་འཕོས་ནས་མི་རྣམས་དང་སྐལ་བ་མཉམ་པར་སྐྱེ་བ་དང་། དེ་མིར་གྱུར་ན་བཙུན་པར་བྱེད་པ་ལྔ་འཐོབ་པར་འགྱུར་རོ། ། ལྔ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། དེ་རིགས་བཙུན་པར་སྐྱེ་བར་འགྱུར་བ་དང་། གཟུགས་བཙུན་པར་འགྱུར་བ་དང་། ཚུལ་ཁྲིམས་བཙུན་པར་འགྱུར་བ་དང་། དེའི་འཁོར་བཙུན་པར་འགྱུར་བ་དང་། དེའི་སེམས་ཅན་བཙུན་པ་རྣམས་ལ་བྱམས་པ་སྒོམ་པར་འགྱུར་བ་སྟེ། ཤཱ་རིའི་བུ་བཙུན་པར་བྱེད་པའི་ཆོས་ལྔ་པོ་དེ་དག་འཐོབ་པར་འགྱུར་རོ། །
en: “Moreover, Śāriputra, there is a further set of four things the bodhisatva obtains. What are these four things? When he passes from his divine abode and comes to dwell among human beings, he will possess five noble qualities in his existence as a human being. What are these five noble qualities? He will be born into a noble family, he will be noble in his appearance, he will be noble in his morality, he will be noble in the company of his followers, and he will be noble in the love sentient beings will have for him. These, Śāriputra, are the five noble qualities he obtains.

source: གཞན་ཡང་མི་ཕྱེད་པར་བྱེད་པའི་ཆོས་ལྔ་འཐོབ་པར་འགྱུར་ཏེ། ལྔ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། དེའི་མཛའ་བོ་མི་ཕྱེད་པ་དང་། ལུས་མྱུར་དུ་འཇིག་པར་མི་འགྱུར་བ་དང་། དེའི་ལོངས་སྤྱོད་ཡོངས་སུ་ཉམས་པར་མི་འགྱུར་བ་དང་། བྱང་ཆུབ་ཀྱི་སེམས་དང་འབྲལ་བར་མི་ནུས་པ་དང་། ཆོས་ཀྱི་མུ་གེ་འབྱུང་བ་ན་དེ་ལ་ཆོས་ཀྱི་ལོ་ལེགས་པར་འགྱུར་ཏེ ཤཱ་རིའི་བུ་མི་ཕྱེད་པར་བྱེད་པའི་ཆོས་ལྔ་པོ་དེ་དག་འཐོབ་པར་འགྱུར་རོ། །
en: “Moreover, he will possess five qualities of inseparability. What are these five qualities of inseparability? He is not separated from his friend. He is not separated from his body, as it does not decay rapidly. He is not separated from pleasures. It is impossible for him to become separated from the mind of awakening, and if the Dharma is hard to obtain, he provides the Dharma in abundance. These, Śāriputra, are the five qualities of inseparability he obtains.

source: གཞན་ཡང་ངོ་མཚར་ཡོངས་སུ་རྫོགས་པའི་ཆོས་ལྔ་འཐོབ་པར་འགྱུར་ཏེ། ལྔ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། གང་སྣོད་སྟོང་པ་གསོག་བཞག་པར་གྱུར་པ་རྣམས་སུ་དེའི་ལག་པ་གང་དུ་བཅུག་པ་དེ་དག་ཐམས་ཅད་རིན་པོ་ཆེས་ཡོངས་སུ་གང་བར་འགྱུར་ཏེ། ངོ་མཚར་ཡོངས་སུ་རྫོགས་པ་དང་པོ་འདི་འཐོབ་པར་འགྱུར་རོ། ། དེ་སྐོམ་པར་གྱུར་ན་ཡན་ལག་བརྒྱད་དང་ལྡན་པའི་ཆུའི་རྫིང་བུ་འབྱུང་སྟེ། ངོ་མཚར་ཡོངས་སུ་རྫོགས་པ་གཉིས་པ་འདི་འཐོབ་པར་འགྱུར་རོ། ། གཞན་ཡང་དེའི་ལུས་ལ་གཞན་གྱིས་གནོད་པར་བྱ་བར་མི་འགྱུར་ཏེ། འདི་ལྟ་སྟེ། དུག་དང་། མཚོན་དང་། མེ་དང་། ཆུ་དང་། མདངས་འཕྲོག་པའི་གནོད་སྦྱིན་གྱིས་གཙེ་བ་མེད་པ་སྟེ། ངོ་མཚར་ཡོངས་སུ་རྫོགས་པ་གསུམ་པ་འདི་འཐོབ་པར་འགྱུར་རོ། ། གཞན་ཡང་མཚོན་གྱི་བསྐལ་པ་བར་མ་བྱུང་བ་འམ། ནད་ཀྱི་བསྐལ་པ་བར་མ་བྱུང་བའམ། མུ་གེའི་བསྐལ་པ་བར་མ་བྱུང་བའམ། མེའི་བསྐལ་པ་བར་མ་བྱུང་བ་འམ། ཆུའི་བསྐལ་པ་བར་མ་བྱུང་བ་འམ། རླུང་གི་བསྐལ་པ་བར་མ་བྱུང་བའམ། སྐོམ་པའི་བསྐལ་པ་བར་མ་འམ། ཀུན་དུ་གདུང་བའི་བསྐལ་པ་བར་མའམ། གནོད་སྦྱིན་གྱི་བསྐལ་པ་བར་མ་བྱུང་བ་ན་འཛམ་བུའི་གླིང་དུ་སྐྱེ་བར་མི་འགྱུར་གྱི། དེ་ལྷར་སྐྱེ་སྟེ དེ་བདེ་བ་དང་། མཐུ་དང་ལྡན་པར་འགྱུར་ཞིང་བདེ་བ་དང་། མཐུ་མང་བར་འགྱུར་ཏེ། ངོ་མཚར་ཡོངས་སུ་རྫོགས་པ་བཞི་པོ་འདི་འཐོབ་པར་འགྱུར་རོ། །
en: “Moreover, he will possess five wonder-working abilities. What are these five wonder-working abilities? The first wonder-working ability is that any empty, worn-out container upon which he places his hand becomes filled with jewels. The second wonder-working ability is that he can manifest reservoirs of water that possesses eight qualities for those who are thirsty. The third wonder-working ability is that no external physical harm can befall him, whether it be injuries caused by poison, by weapons, by fire, by water, or by harmful yakṣas. The fourth wonder-working ability is that he is not born on the Jambu continent during an age of strife, an age of plague, an age of famine, an age of fire, an age of water, an age of wind, an age of thirst, an age of affliction, or an age of yakṣas. During these ages, he will take divine birth, with its pleasures and its strength. He will be exceedingly happy and strong. The fifth wonder-working ability, Śāriputra, is that as he possesses these roots of virtue, the bodhisatva is not born into unfortunate circumstances. He is not born into the lower realms. It is not possible for him to become entangled in misfortune. Renunciation is quick to spring forth in him.

source: གཞན་ཡང་ཤཱ་རིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་དགེ་བའི་རྩ་བ་དེ་ཉིད་ཀྱིས་མི་དལ་བར་མི་སྐྱེ། ངན་འགྲོར་མི་སྐྱེ། སེམས་ལ་འགྱོད་པས་ཀུན་ཏུ་དཀྲི་བར་མི་ནུས་ཤིང་ངེས་པར་འབྱུང་བ་མྱུར་དུ་མཐོང་བར་འགྱུར་ཏེ། ངོ་མཚར་ཡོངས་སུ་རྫོགས་པ་ལྔ་པ་འདི་འཐོབ་པར་འགྱུར་རོ། ། ཤཱ་རིའི་བུ་བྱང་ཆུབ་སེམས་དཔའི་ངོ་མཚར་ཡོངས་སུ་རྫོགས་པ་ལྔ་པོ་འདི་དག་འཐོབ་པར་འགྱུར་རོ། །
en: “Moreover, Śāriputra, with these roots of virtue there are four things that he will not lack. What are these four things? When he sees the suffering of sentient beings, the bodhisatva will develop great compassion. Those who are his sons and daughters will have great reverence and respect for him. Even if age takes its toll on him, he will not buckle. The benefits that come from the actions he performs are multiplied a hundredfold, or even two or three hundredfold. These are the four things that the bodhisatva comes to possess and that he will never be without.

source: གཞན་ཡང་ཤཱ་རིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་དགེ་བའི་རྩ་བ་དེ་ཉིད་ཀྱིས་ཆོས་བཞི་དང་མི་འབྲལ་བར་འགྱུར་ཏེ། བཞི་གང་ཞེ་ན། བྱང་ཆུབ་སེམས་དཔའི་སྡུག་བསྔལ་བའི་སེམས་ཅན་རྣམས་མཐོང་མ་ཐག་ཏུ་སྙིང་རྗེ་ཆེན་པོ་འཐོབ་པ་དང་། དེ་ལ་དེའི་བུ་དང་བུ་མོ་གུས་པ་དང་བཅས་ཤིང་ཞེས་བྱེད་པར་འགྱུར་བ་དང་། རྒ་བས་བཅོམ་ཡང་བརྙས་པར་མི་འགྱུར་བ་དང་། དེ་ལས་ཀྱི་མཐའ་གང་བྱེད་པ་དེ་དག་ཀྱང་ཉིས་འགྱུར་སུམ་འགྱུར་དུ་འཐོབ་པར་འགྱུར་བ་སྟེ། ཆོས་བཞི་པོ་དེ་དག་དང་རྟག་ཏུ་རྒྱུན་མི་འཆད་པར་མི་འབྲལ་བར་འགྱུར་རོ། །
en: “Moreover, Śāriputra, with these roots of virtue there are three things that will not carry the bodhisatva away. What are these three things? He will not be carried away by desire, he will not be carried away by anger, and he will not be carried away by confusion. These are the three things that will not carry him away.

source: གཞན་ཡང་ཤཱ་རིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་དགེ་བའི་རྩ་བ་དེ་ཉིད་དང་ལྡན་པས་ཆོས་གསུམ་གྱིས་མི་འཕྲོགས་ཏེ། གསུམ་གང་ཞེ་ན། ཆགས་པས་མི་འཕྲོགས་པ་དང་། ཞེ་སྡང་དང་། གཏི་མུག་གིས་མི་འཕྲོགས་པ་སྟེ། ཆོས་གསུམ་པོ་དེ་དག་གིས་མི་འཕྲོགས་སོ། །
en: “Moreover, Śāriputra, with these roots of virtue the bodhisatva obtains four kinds of well-being. What are these four kinds of well-being? He does not become afflicted by long-lasting illness. His joints do not become stiff. He is able to enjoy pleasures. He does not have to suffer the harm that kings or thieves are able to inflict on other sentient beings. These, Śāriputra, are the four types of well-being that the bodhisatva obtains.
